Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/office_of_the_taxing_master.html.txt.tmx
Source language: en
Languages: ga

source: Office of the Taxing Master
ga: Oifig an Mháistir Fómhais

source: The Taxing Master provides an independent and impartial assessment of legal costs incurred by an individual or company involved in litigation ("taxation of costs")
ga: Cuireann an Máistir Fómhais measúnú neamhspleách agus neamhchlaonta ar fáil de na costais dhlíthiúla a bhíonn ar dhuine nó ar chomhlacht i mbun dlíthíochta ("cánachas costas")

source: This means, that they assess the fair and reasonable amount that one party has to pay to the other side
ga: Ciallaíonn sé seo go measúnaíonn siad an méid féaráilte agus réasúnta a chaithfidh aon pháirtí amháin a íoc don taobh eile

source: There are currently 2 Taxing Masters in Ireland, both of whom are based in Dublin
ga: Faoi láthair tá dhá Mháistir Fómhais in Éirinn agus tá an bheirt acu lonnaithe i mBaile Átha Cliath

source: (See 'Where to apply')
ga: (Féach ‘Ca háit a ndéanfaidh mé iarratas’)

source: Usually, costs are taxed at the end/conclusion of a case, but this doesn't always happen
ga: Go hiondúil, leagtar cáin ar chostais ag deireadh/críochnú cáis, agus ní tharlaíonn sé seo i gcónaí

source: Sometimes, a Court may award costs in respect of certain applications prior to the final conclusion of the case
ga: Uaireanta, déanfaidh cúirt dámhachtain de chostais i dtaobh iarratas áirithe roimh chríochnú deireanach an cháis

source: The party that is claiming the costs (usually, the successful plaintiff or defendant) must demonstrate that the costs they are claiming were proper and reasonable, given the circumstances
ga: Caithfidh an páirtí atá ag éileamh na gcostas (go hiondúil an t-Éilitheoir nó an Cosantóir) a léiriú go bhfuil na costas atá siad ag éileamh cuí agus réasúnta ó thaobh na gcúinsí de

source: There are two main types of costs:
ga: Tá dhá phríomhchineál costais ann:

source: • Party and Party Costs
ga: • Costais Pháirtí agus Pháirtí

source: • Solicitor and Client Costs
ga: • Costais Aturnae agus Chliaint

source: Party and Party Costs: These are essentially all the costs, charges and expenses that are reasonably incurred by one of the parties in the action, for the purposes of the case
ga: Costais Pháirtí agus Pháirtí Is iad seo go bunúsach na costais agus táillí go léir a ghearrtar go réasúnta ar dhuine de na páirtithe sa ghníomh, le haghaidh chuspóirí an cháis

source: It's important to remember that all the costs may not be allowable and if you are claiming these costs, you must be able to justify why they were incurred and why those costs should be allowed
ga: Tá sé tábhachtach cuimhniú go bhfuil seans ann nach mbeidh na costais go léir ceadmhach agus má tá tú ag éileamh na gcostas seo, caithfidh tú a chruthú cén fáth a gearradh iad agus cén fáth ar cheart iad a cheadú

source: The courts have held in the past that you are bound when conducting your case to remember that your adversary may in the end have to pay your costs (or you may have to pay theirs) so it pays to be mindful of costs at all times
ga: Tá sé dearbhaithe ag na cúirteanna go gcaithfidh túagus do chás á phlé agat cuimhniú go bhfuil seans ann go mbeidh ar do chéile comhraic íoc as do chuid costas (nó seans go mbeidh ort íoc as a gcostas siúd) mar sin tá sé tairbheach na costais a bheith i d’intinn agat

source: Solicitor and Client Costs: These are the costs you are obliged to pay your solicitor or legal representative that are not recoverable under Party and Party Costs
ga: Costais Aturnae agus Chliaint

source: The Solicitors (Amendment) Act, 1994 (Section 68) provides for solicitors to charge their clients
ga: Ligeann Acht na nAturnaethe (Leasú), 1994 (Alt 68) d’aturnaethe táillí a ghearradh ar a gcliaint

source: Under this legislation, your solicitor should give you a detailed statement of all the legal costs associated with your case
ga: Faoin reachtaíocht seo, ba cheart go dtabharfadh d’aturnae ráiteas sonraithe de na costais dlíthiúla go léir a bhaineann le do chás

source: The statement of costs you receive, must contain certain things:
ga: Ba cheart go mbeadh nithe áirithe san áireamh le ráiteas na gcostas:

source: • Summary of the legal services you were provided with
ga: • achoimre ar na seirbhísí dlíthiúla a soláthraíodh duit

source: • Details of all the charges that were incurred the the nature of these charges
ga: • sonraí ar na táillí go léir a gearradh maidir leis na costais seo

source: • Total amount (value) of damages you received, or other money that was recovered
ga: • méid iomlán (luach) na ndamáistí a bhfuair tú, nó airgead eile a thángthas air

source: This detailed statement of charges and costs is known as a Bill of Costs
ga: Tá an ráiteas sonraithe seo de tháillí agus de chostas aitheanta mar Bille Costas

source: The 'taxation of costs' is a misleading term, in that it has nothing to do with taxation in the normal sense or with the Revenue Commissioners
ga: Téarma a d’fhéadfadh thú a chur amú is ea ‘cánachas costas’ mar níl aon bhaint aige le cánachas sa ghnáthchiall nó leis na Coimisinéirí Ioncaim

source: Taxation of costs from an action/case arise in a number of different situations (for example, when ordered by the court, when demanded by a client, when ordered by a tribunal, as a result of an arbitration hearing, etc.)
ga: Éiríonn cánachas costas ó ghníomh/ ó chás i líon difriúil suíomhanna (mar shampla, nuair atá ordaithe ag an gcúirt, nuair atá éilithe ag cliant, nuair atá orduithe ag binse fiosraithe, mar thoradh ar éisteacht eadrána, etc.)

source: The Taxing Master does not have any regulatory or investigative powers in relation to complaints about excessive charges by solicitors in Ireland for legal services
ga: Níl aon chumhachtaí rialaíocha nó imscrúdaithe i dtaobh gearán faoi tháillí iomarcacha ag aturnaethe in Éirinn do sheirbhísí dlíthiúla

source: Complaints about excessive charges should be referred to the Law Society of Ireland
ga: Ba cheart gearáin faoi tháillí iomarcacha a chur faoi bhráid Chumann Dlí na hÉireann

source: If you wish to have your costs subject to taxation, you should instruct your solicitor to forward a special form (called a 'Requisition to Tax' form) to you , so that the Bill of Costs can be subject to taxation
ga: Más maith leat go mbeadh cánachas le do chostais, ba cheart duit treoir a thabhairt do d’aturnae foirm speisialta a chur chugat (darbh ainm Foirm Foréilimh Chánachais), ionas go mbeidh cánachas i gceist leis an mBille Costas

source: When you receive this form, you sign and return it to your solicitor who will then set the matter down for taxation
ga: Nuair a fhaigheann tú an fhoirm seo, síníonn tú agus athsheolann tú é chuig d’aturnae a leagfaidh síos é le haghaidh cánachais

source: You will then be notified by your solicitor of the date of the taxation and you should attend the hearing
ga: Cuirfidh d’aturnae ar an eolas thú faoi dháta an chánachais agus ba cheart duit freastal ar an éisteacht

source: It's important to remember that you have the option of retaining a legal representative for the taxation hearing
ga: Tá sé tábhachtach cuimhniú go bhfuil an rogha agat ionadaíocht dhlíthiúil a choinneáil le haghaidh na héisteachta cánachais

source: If your solicitor refuses to set the matter down for taxation, you can set the matter down yourself by completing and lodging the Requisition to Tax form, lodging a Summons to Tax/Notice to Tax (in triplicate form) and lodging the Bill of Costs with the Office of the Taxing Master
ga: Má dhíultaíonn d’aturnae an scéal a leagan síos le haghaidh cánachais, is féidir leat an scéal a leagan síos thú féin ach an Fhoirm Foréilimh Chánachais a chríochnú agus a thaisceadh, ag taisceadh Toghairm do Chánachas/ Fógra do Chánachas (i bhfoirm thrífhillte) agus ag taisceadh Bille Costas le hOifig an Mháistir Fómhais

source: (You can purchase the Requisition of Taxes form and the Summons form in any legal stationers)
ga: (Is féidir leat an Fhoirm Fhoréilimh Cánachais agus an fhoirm Thoghairme a cheannach ó aon stáiseanóir dlíthiúil

source: The Office of the Taxing Master will then inform you when you should be in attendance for the hearing
ga: Cuirfidh Oifig an Mháistir Fómhais ar an eolas thú nuair ba cheart duit i láthair na héisteachta

source: Further information about taxation hearings and the taxation of costs process is available from the website of the Courts Service
ga: Tá tuilleadh eolais faoi éisteachtaí cánach agus cáin a ghearradh ar an bpróiseas costais ar fáil ó láithreán gréasáin na Seirbhíse Cúirteanna

source: Apply to the Taxing Masters' Office at
ga: Cuir iarratas isteach chuig an Oifig an Mháistir Fómhais ag

source: Tel:+353 (0)1 888 6301
ga: Teil:+353 (0)1 888 6301
